alvin233/F407_uCOSIII_191021/Examples/ST/STM32F429II-SK/OS3/w5500.c
/**********************************************************************************
 * 文件名  ：W5500.c
 * 描述    ：W5500 驱动函数库         
 * 库版本  ：ST_v3.5

 * 淘宝    ：http://yixindianzikeji.taobao.com/
**********************************************************************************/

#include "stm32f4xx.h"
#include "stm32f4xx_spi.h"				
#include "W5500.h"	
#define   BSP_MODULE
#include  <bsp.h>
#include  <os.h>
#include <string.h>
/***************----- 网络参数变量定义 -----***************/
unsigned char Gateway_IP[4];//网关IP地址 
unsigned char Sub_Mask[4];	//子网掩码 
unsigned char Phy_Addr[6];	//物理地址(MAC) 
unsigned char IP_Addr[4];	//本机IP地址 

unsigned char S0_Port[2];	//端口0的端口号(5000) 
unsigned char S0_DIP[4];	//端口0目的IP地址 
unsigned char S0_DPort[2];	//端口0目的端口号(6000) 

unsigned char UDP_DIPR[4];	//UDP(广播)模式,目的主机IP地址
unsigned char UDP_DPORT[2];	//UDP(广播)模式,目的主机端口号

/***************----- 端口的运行模式 -----***************/
unsigned char S0_Mode =3;	//端口0的运行模式,0:TCP服务器模式,1:TCP客户端模式,2:UDP(广播)模式
#define TCP_SERVER	0x00	//TCP服务器模式
#define TCP_CLIENT	0x01	//TCP客户端模式 
#define UDP_MODE	0x02	//UDP(广播)模式 

/***************----- 端口的运行状态 -----***************/
unsigned char S0_State =0;	//端口0状态记录,1:端口完成初始化,2端口完成连接(可以正常传输数据) 
#define S_INIT		0x01	//端口完成初始化 
#define S_CONN		0x02	//端口完成连接,可以正常传输数据 

/***************----- 端口收发数据的状态 -----***************/
unsigned char S0_Data;		//端口0接收和发送数据的状态,1:端口接收到数据,2:端口发送数据完成 
#define S_RECEIVE	 0x01	//端口接收到一个数据包 
#define S_TRANSMITOK 0x02	//端口发送一个数据包完成 

/***************----- 端口数据缓冲区 -----***************/
unsigned char Rx_Buffer[2048];	//端口接收数据缓冲区 
unsigned char Tx_Buffer[2048];	//端口发送数据缓冲区 

unsigned char W5500_Interrupt;	//W5500中断标志(0:无中断,1:有中断)

/*******************************************************************************
* 函数名  : W5500_GPIO_Configuration
* 描述    : W5500 GPIO初始化配置
* 输入    : 无
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void W5500_GPIO_Configuration(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  EXTI_InitTypeDef   EXTI_InitStructure; 
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Enable Port B clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
  /* W5500_INT_Pin Init */
  GPIO_InitStructure.GPIO_Pin = W5500_INT_Pin;
  GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN; // GPIO_Mode_IPU
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;// inner pull up       
  GPIO_Init(W5500_INT_PORT, &GPIO_InitStructure);
  /* W5500_RST_Pin Init */
  GPIO_InitStructure.GPIO_Pin  = W5500_RST_Pin;
  GPIO_InitStructure.GPIO_Speed=GPIO_Speed_25MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;// GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;// GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;// floating
  GPIO_Init(W5500_RST_PORT, &GPIO_InitStructure);
  GPIO_ResetBits(W5500_RST_PORT, W5500_RST_Pin);
  /* W5500_SCS_Pin Init */
  GPIO_InitStructure.GPIO_Pin  = W5500_SCS_Pin;
  GPIO_InitStructure.GPIO_Speed=GPIO_Speed_25MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;// GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;// GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;// floating
  GPIO_Init(W5500_RST_PORT, &GPIO_InitStructure);
  GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);

  /* for EXTI, must enable RCC_APB2Periph_SYSCFG */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);//
  /* Connect EXTI Line4 to PC4 */
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC, GPIO_PinSource4);
  /* PC4 as W5500 interrupt input */
  EXTI_InitStructure.EXTI_Line = EXTI_Line4;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;//的例子设置中断线4上的中断为下降沿触发
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);
  /* Init NVIC */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn; 
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x02; 
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x02; 
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
  NVIC_Init(&NVIC_InitStructure);
  /* enable int in ucos iii */
  BSP_IntVectSet(BSP_INT_ID_EXTI4, EXTI4_IRQHandler); //MY_BSP_IntHandlerUSART2
  BSP_IntEn(BSP_INT_ID_EXTI4);
}


/*******************************************************************************
* 函数名  : SPI_Configuration
* 描述    : W5500 SPI初始化配置(STM32 SPI1)
* 输入    : 无
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void SPI_Configuration(void)
{
        SPI_InitTypeDef  SPI_InitStructure;
        GPIO_InitTypeDef GPIO_InitStructure;
        /* GPIO Init */
        /* enable AHB1 */
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);//使能GPIOD时钟

        GPIO_InitStructure.GPIO_Pin = W5500_SPI_CLK_Pin |W5500_SPI_MISO_Pin | W5500_SPI_MOSI_Pin;// Pin selection
        GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//推挽输出
        GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;////下拉	
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//普通输出模式 GPIO_Mode_OUT
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;//100MHz
        GPIO_Init(GPIOB, &GPIO_InitStructure);//初始化GPIOD
        //打开引脚的复用功能
        GPIO_PinAFConfig(GPIOB,GPIO_PinSource13,GPIO_AF_SPI2);  
        GPIO_PinAFConfig(GPIOB,GPIO_PinSource14,GPIO_AF_SPI2);
        GPIO_PinAFConfig(GPIOB,GPIO_PinSource15,GPIO_AF_SPI2);
    /* GPIO AF Function Eanble */
    /* 初始化配置STM32 SPI2 */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2,ENABLE);  //时钟
	SPI_InitStructure.SPI_Direction=SPI_Direction_2Lines_FullDuplex;	//SPI设置为双线双向全双工
	SPI_InitStructure.SPI_Mode=SPI_Mode_Master;							//设置为主SPI
	SPI_InitStructure.SPI_DataSize=SPI_DataSize_8b;						//SPI发送接收8位帧结构
	SPI_InitStructure.SPI_CPOL=SPI_CPOL_Low; //时钟悬空低 SPI_CPOL_Low
	SPI_InitStructure.SPI_CPHA=SPI_CPHA_1Edge;							//数据捕获于第1个时钟沿
	SPI_InitStructure.SPI_NSS=SPI_NSS_Soft;								//NSS由外部管脚管理
	SPI_InitStructure.SPI_BaudRatePrescaler=SPI_BaudRatePrescaler_2;	//波特率预分频值为2 SPI_BaudRatePrescaler_2
	SPI_InitStructure.SPI_FirstBit=SPI_FirstBit_MSB;					//数据传输从MSB位开始
	SPI_InitStructure.SPI_CRCPolynomial=7;								//CRC多项式为7
	SPI_Init(SPI2,&SPI_InitStructure);									//根据SPI_InitStruct中指定的参数初始化外设SPI1寄存器
	SPI_Cmd(SPI2,ENABLE);	//STM32使能SPI2
}
/*******************************************************************************
* 函数名  : SPI1_Send_Byte
* 描述    : SPI1发送1个字节数据
* 输入    : dat:待发送的数据
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void SPI2_Send_Byte(unsigned char dat)
{
	SPI_I2S_SendData(SPI_SEL,dat);//写1个字节数据
	while(SPI_I2S_GetFlagStatus(SPI_SEL, SPI_I2S_FLAG_TXE) == RESET);//等待数据寄存器空
}

